app/Controllers/ClienteControlador.php

UPDATE `cliente` SET `NOMBRE` = 'alonso1', `CORREO_ELECTRONICO` = 'alonso@gmail.com', `CONTRASEÑA` = '$2y$10$XpiKONOXPMZl3df5WYcgiu3OHGkhRkjp/CBZdfX9HtQv2MCZRpAS2', `FECHA_BAJA` = NULL
WHERE `cliente`.`PK_ID_CLIENTE` IN ('8')
---
    public function guardarCliente($id = null)
    {
        $clienteModel = new ClienteModel();
        helper(['form', 'url']);
        // Cargar datos del cliente si es edición
        $data['cliente'] = $id ? $clienteModel->find($id) : null;

        if ($this->request->getMethod() == 'POST') {
            // Reglas de validación
            $validation = \Config\Services::validation();
            $validation->setRules([
                'NOMBRE' => 'required|min_length[3]|max_length[50]',
                'CORREO_ELECTRONICO' => 'required|valid_email',
                'CONTRASEÑA' => 'required|min_length[6]'
            ]);

            if (!$validation->withRequest($this->request)->run()) {
                // Mostrar errores de validación
                $data['validation'] = $validation;
            }else{
                // Preparar datos del formulario
                $clienteData = [
                    'NOMBRE' => $this->request->getPost('NOMBRE'),
                    'CORREO_ELECTRONICO' => $this->request->getPost('CORREO_ELECTRONICO'),
                    'CONTRASEÑA' => password_hash($this->request->getPost('CONTRASEÑA'), PASSWORD_DEFAULT),
                    'FECHA_BAJA' => null // Se puede manejar posteriormente si se requiere
                ];

                if ($id) {
                    // Actualizar cliente existente
                    $clienteModel->update($id, $clienteData);

SELECT `cliente`.*, `rol`.`ROL`
FROM `cliente`
LEFT JOIN `rol` ON `cliente`.`ID_ROL` = `rol`.`PK_ID_ROL`
WHERE `cliente`.`CORREO_ELECTRONICO` = 'patricia123@gmail.com'
 LIMIT 1
---
    public function InicioSesion()
{
    helper(['form', 'url']);
    $session = session();

    $rules = [
        'CORREO_ELECTRONICO' => 'required|valid_email',
        'CONTRASEÑA' => 'required'
    ];

    if (!$this->validate($rules)) {
        return view('login', [
            'validation' => $this->validator,
        ]);
    }

    $clienteModel = new ClienteModel();

    $cliente = $clienteModel->select('cliente.*, rol.ROL')
                            ->join('rol', 'cliente.ID_ROL = rol.PK_ID_ROL', 'left')
                            ->where('cliente.CORREO_ELECTRONICO', $this->request->getPost('CORREO_ELECTRONICO'))
                            ->first();