app/Controllers/ClienteControlador.php

    public function InicioSesion()
{
    helper(['form', 'url']);
    $session = session();

    $rules = [
        'CORREO_ELECTRONICO' => 'required|valid_email',
        'CONTRASEÑA' => 'required'
    ];

    if (!$this->validate($rules)) {
        return view('login', [
            'validation' => $this->validator,
        ]);
    }

    $clienteModel = new ClienteModel();

    $cliente = $clienteModel->select('cliente.*, rol.ROL')
                            ->join('rol', 'cliente.ID_ROL = rol.PK_ID_ROL', 'left')
                            ->where('cliente.CORREO_ELECTRONICO', $this->request->getPost('CORREO_ELECTRONICO'))
                            ->first();
---
SELECT `cliente`.*, `rol`.`ROL`
FROM `cliente`
LEFT JOIN `rol` ON `cliente`.`ID_ROL` = `rol`.`PK_ID_ROL`
WHERE `cliente`.`CORREO_ELECTRONICO` = 'pepelux123@gmail.com'
 LIMIT 1