app/Controllers/ClienteControlador.php

    public function index()
    {

        $clienteModel = new ClienteModel();

        $nombre = $this->request->getVar('NOMBRE'); // Obtener el nombre desde la URL

        // Construir la consulta para obtener clientes con sus roles
        $query = $clienteModel->select('cliente.*, rol.ROL')
                              ->join('rol', 'cliente.ID_ROL = rol.PK_ID_ROL', 'left');

        if ($nombre) {
            $query = $query->like('cliente.NOMBRE', $nombre);
        }

        $perPage = 3; // Número de elementos por página
        $data['clientes'] = $query->paginate($perPage); // Obtener clientes paginados
---
SELECT *
FROM `cliente`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `cliente`