app/Controllers/EventoControlador.php

SELECT *
FROM `evento`
---
    public function obtenerEventos()
{
    $eventoModel = new EventoModel();
    $eventos = $eventoModel->findAll();