app/Controllers/MedicamentoControlador.php

SELECT *
FROM `medicamento`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `medicamento`
---
    public function index()
    {
        $medicamentoModel = new MedicamentoModel();
        $query = $medicamentoModel;
        $nombre = $this->request->getVar('NOMBRE'); // Obtener el nombre desde la URL

        if ($nombre) {
            $query = $query->like('NOMBRE', $nombre);
        }

        $perPage = 3; // Número de elementos por página
        $data['medicamentos'] = $query->paginate($perPage); // Obtener medicamentos paginados