app/Models/ClienteModel.php

    public function obtenerClientesConRol()
    {
        return $this->select('cliente.*, rol.ROL')
                    ->join('rol', 'cliente.ID_ROL = rol.PK_ID_ROL', 'left')
                    ->findAll();
---
SELECT `cliente`.*, `rol`.`ROL`
FROM `cliente`
LEFT JOIN `rol` ON `cliente`.`ID_ROL` = `rol`.`PK_ID_ROL`